<a href="https://colab.research.google.com/github/GIT-REPO-JAGAN/PYTHON-GOOGLE-COLOB/blob/main/C_23Python_Pandas_PC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

####import pandas as pd Reading excel as dataframe

In [ ]:
import pandas as pd

In [ ]:
shares_df = pd.read_excel('share_example.xlsx')

In [ ]:
shares_df

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [ ]:
shares_df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
shares_df.columns

Index(['Date', 'A', 'B ', 'C', 'D', 'E'], dtype='object')

In [ ]:
shares_df.values

array([[Timestamp('2022-01-20 00:00:00'), 99, 20, 45, 56, 2000],
       [Timestamp('2022-01-21 00:00:00'), 98, 19, 47, 55, 1993],
       [Timestamp('2022-01-22 00:00:00'), 95, 19, 50, 60, 1921],
       [Timestamp('2022-01-23 00:00:00'), 101, 22, 56, 61, 1976],
       [Timestamp('2022-01-24 00:00:00'), 103, 22, 55, 65, 2010]],
      dtype=object)

In [ ]:
shares_df['Date'].loc[0]

Timestamp('2022-01-20 00:00:00')

In [ ]:
type(shares_df['Date'].loc[0])

pandas._libs.tslibs.timestamps.Timestamp

#### stack

In [ ]:
shares_df

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [ ]:
shares_stacked = shares_df.stack()
shares_stacked

0  Date    2022-01-20 00:00:00
   A                        99
   B                        20
   C                        45
   D                        56
   E                      2000
1  Date    2022-01-21 00:00:00
   A                        98
   B                        19
   C                        47
   D                        55
   E                      1993
2  Date    2022-01-22 00:00:00
   A                        95
   B                        19
   C                        50
   D                        60
   E                      1921
3  Date    2022-01-23 00:00:00
   A                       101
   B                        22
   C                        56
   D                        61
   E                      1976
4  Date    2022-01-24 00:00:00
   A                       103
   B                        22
   C                        55
   D                        65
   E                      2010
dtype: object

In [ ]:
type(shares_stacked)

pandas.core.series.Series

In [ ]:
shares_stacked.index

MultiIndex([(0, 'Date'),
            (0,    'A'),
            (0,   'B '),
            (0,    'C'),
            (0,    'D'),
            (0,    'E'),
            (1, 'Date'),
            (1,    'A'),
            (1,   'B '),
            (1,    'C'),
            (1,    'D'),
            (1,    'E'),
            (2, 'Date'),
            (2,    'A'),
            (2,   'B '),
            (2,    'C'),
            (2,    'D'),
            (2,    'E'),
            (3, 'Date'),
            (3,    'A'),
            (3,   'B '),
            (3,    'C'),
            (3,    'D'),
            (3,    'E'),
            (4, 'Date'),
            (4,    'A'),
            (4,   'B '),
            (4,    'C'),
            (4,    'D'),
            (4,    'E')],
           )

In [ ]:
shares_stacked.values

array([Timestamp('2022-01-20 00:00:00'), 99, 20, 45, 56, 2000,
       Timestamp('2022-01-21 00:00:00'), 98, 19, 47, 55, 1993,
       Timestamp('2022-01-22 00:00:00'), 95, 19, 50, 60, 1921,
       Timestamp('2022-01-23 00:00:00'), 101, 22, 56, 61, 1976,
       Timestamp('2022-01-24 00:00:00'), 103, 22, 55, 65, 2010],
      dtype=object)

In [ ]:
shares_stacked[(1, 'D')]

55

In [ ]:
shares_df

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [ ]:
shares_df['D'].loc[1]

55

In [ ]:
data = {'company': ['A', 'B', 'C', 'C', 'B', 'B', 'A', 'D', 'D'],
       'year': [2019, 2018, 2018, 2019, 2019, 2020, 2018, 2018, 2019],
       'sales': [100, 89, 70, 85, 67, 110, 76, 56, 71],
       'profits': [11, 9, 4, 17, 20, -10, 7, 7, 18]}

In [ ]:
data

{'company': ['A', 'B', 'C', 'C', 'B', 'B', 'A', 'D', 'D'],
 'year': [2019, 2018, 2018, 2019, 2019, 2020, 2018, 2018, 2019],
 'sales': [100, 89, 70, 85, 67, 110, 76, 56, 71],
 'profits': [11, 9, 4, 17, 20, -10, 7, 7, 18]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [ ]:
df.columns

Index(['company', 'year', 'sales', 'profits'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [ ]:
df.values

array([['A', 2019, 100, 11],
       ['B', 2018, 89, 9],
       ['C', 2018, 70, 4],
       ['C', 2019, 85, 17],
       ['B', 2019, 67, 20],
       ['B', 2020, 110, -10],
       ['A', 2018, 76, 7],
       ['D', 2018, 56, 7],
       ['D', 2019, 71, 18]], dtype=object)

In [ ]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [ ]:
df['company'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [ ]:
df['year'].unique()

array([2019, 2018, 2020], dtype=int64)

In [ ]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [ ]:
# fetch all the rows/data for company 'B'

df[df['company'] == 'B']

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [ ]:
df['company']

0    A
1    B
2    C
3    C
4    B
5    B
6    A
7    D
8    D
Name: company, dtype: object

In [ ]:
df['company'] == 'B'

0    False
1     True
2    False
3    False
4     True
5     True
6    False
7    False
8    False
Name: company, dtype: bool

In [ ]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [ ]:
# fetch the rows/data for the company 'A' for the year 2018
df[(df['company'] == 'A') & (df['year'] == 2018)]

  company  year  sales  profits
6       A  2018     76        7

In [ ]:
# fetch all the profits for company 'B'
df[df['company'] == 'B']

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [ ]:
df[df['company'] == 'B']['profits']

1     9
4    20
5   -10
Name: profits, dtype: int64

In [ ]:
# sum of the profits of company 'B'
df[df['company'] == 'B']['profits'].sum()

19

In [ ]:
df[df['company'] == 'B']['profits'].mean()

6.333333333333333

In [ ]:
df[df['company'] == 'B']['profits'].median()

9.0

In [ ]:
df[df['company'] == 'B']['profits'].std()

15.17673658377628

In [ ]:
df[df['company'] == 'B']['profits'].var()

230.33333333333331

In [ ]:
df['company']

0    A
1    B
2    C
3    C
4    B
5    B
6    A
7    D
8    D
Name: company, dtype: object

In [ ]:
df['company'].mode()

0    B
Name: company, dtype: object

In [ ]:
df['company'].mode().loc[0]

'B'